app/controllers/posts_controller.rb

	def create
	  @post = Post.new
	  @post.title = params[:post][:title]
	  @post.description = params[:post][:description]
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]

	def update
	  @post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "It seems so. I don't know what the fuck you talking about, buddy!"], ["updated_at", "2019-12-17 05:18:37.920786"], ["id", 4]]